test/support/fixtures/filtered_sales_invoices.json

[
  {
    "id": "264861192618509809",
    "administration_id": 123,
    "contact_id": "264861190840124899",
    "contact": {
      "id": "264861190840124899",
      "administration_id": 123,
      "company_name": "Foobar Holding B.V.",
      "firstname": "",
      "lastname": "",
      "address1": "Hoofdstraat 12",
      "address2": "",
      "zipcode": "1234AB",
      "city": "Amsterdam",
      "country": "NL",
      "phone": "",
      "delivery_method": "Email",
      "customer_id": "1",
      "tax_number": "",
      "chamber_of_commerce": "",
      "bank_account": "",
      "attention": "",
      "email": "info@example.com",
      "email_ubl": true,
      "send_invoices_to_attention": "",
      "send_invoices_to_email": "info@example.com",
      "send_estimates_to_attention": "",
      "send_estimates_to_email": "info@example.com",
      "sepa_active": false,
      "sepa_iban": "",
      "sepa_iban_account_name": "",
      "sepa_bic": "",
      "sepa_mandate_id": "",
      "sepa_mandate_date": null,
      "sepa_sequence_type": "RCUR",
      "credit_card_number": "",
      "credit_card_reference": "",
      "credit_card_type": null,
      "tax_number_validated_at": null,
      "tax_number_valid": null,
      "invoice_workflow_id": null,
      "estimate_workflow_id": null,
      "si_identifier": "",
      "si_identifier_type": null,
      "created_at": "2019-08-26T09:22:16.799Z",
      "updated_at": "2019-08-26T09:22:16.799Z",
      "version": 1566811336,
      "sales_invoices_url": "http://moneybird.dev/123/sales_invoices/8573864450b81cced0423803a218f6528aa52719da9f917d4302a30a38a21d12/all",
      "notes": [],
      "custom_fields": []
    },
    "invoice_id": "2019-0003",
    "recurring_sales_invoice_id": null,
    "workflow_id": "264861010714690884",
    "document_style_id": "264861011128878414",
    "identity_id": "264861010400118083",
    "draft_id": null,
    "state": "open",
    "invoice_date": "2019-08-26",
    "due_date": "2019-09-09",
    "payment_conditions": "We verzoeken u vriendelijk het bovenstaande bedrag van {document.total_price} voor {document.due_date} te voldoen op onze bankrekening onder vermelding van de omschrijving {document.payment_reference}. Voor vragen kunt u contact opnemen per e-mail.",
    "payment_reference": "RF5000000000000005IV79WN4",
    "reference": "Project X",
    "language": "nl",
    "currency": "EUR",
    "discount": "0.0",
    "original_sales_invoice_id": null,
    "paused": false,
    "paid_at": null,
    "sent_at": "2019-08-26",
    "created_at": "2019-08-26T09:22:18.507Z",
    "updated_at": "2019-08-26T09:22:18.771Z",
    "public_view_code": "895025",
    "version": 1566811338,
    "details": [
      {
        "id": "264861192633189874",
        "administration_id": 123,
        "tax_rate_id": "264861010337203517",
        "ledger_account_id": "264861010182014250",
        "product_id": null,
        "amount": "1 x",
        "amount_decimal": "1.0",
        "description": "Project X",
        "price": "300.0",
        "period": null,
        "row_order": 1,
        "total_price_excl_tax_with_discount": "300.0",
        "total_price_excl_tax_with_discount_base": "300.0",
        "tax_report_reference": ["NL/1a"],
        "created_at": "2019-08-26T09:22:18.525Z",
        "updated_at": "2019-08-26T09:22:18.767Z"
      }
    ],
    "payments": [],
    "total_paid": "0.0",
    "total_unpaid": "363.0",
    "total_unpaid_base": "363.0",
    "prices_are_incl_tax": false,
    "total_price_excl_tax": "300.0",
    "total_price_excl_tax_base": "300.0",
    "total_price_incl_tax": "363.0",
    "total_price_incl_tax_base": "363.0",
    "total_discount": "0.0",
    "url": "http://moneybird.dev/123/sales_invoices/a0be22787e88f08e588fca5e01d2695a63905de627c6f36d06b48e9aaf55f233/8573864450b81cced0423803a218f6528aa52719da9f917d4302a30a38a21d12",
    "custom_fields": [],
    "notes": [],
    "attachments": [],
    "events": [
      {
        "administration_id": 123,
        "user_id": 15668111646740,
        "action": "sales_invoice_created",
        "link_entity_id": null,
        "link_entity_type": null,
        "data": {},
        "created_at": "2019-08-26T09:22:18.538Z",
        "updated_at": "2019-08-26T09:22:18.538Z"
      },
      {
        "administration_id": 123,
        "user_id": 15668111646740,
        "action": "sales_invoice_send_email",
        "link_entity_id": null,
        "link_entity_type": null,
        "data": {
          "email_address": "info@example.com",
          "email_message": "Geachte Foobar Holding B.V.,\n\nIn de bijlage kunt u factuur 2019-0003 voor onze diensten vinden. Wij verzoeken u vriendelijk de factuur voor 09-09-2019 te voldoen.\n\nMet vriendelijke groet,\n\nParkietje B.V."
        },
        "created_at": "2019-08-26T09:22:18.832Z",
        "updated_at": "2019-08-26T09:22:18.832Z"
      }
    ],
    "tax_totals": [
      {
        "tax_rate_id": "264861010337203517",
        "taxable_amount": "300.0",
        "taxable_amount_base": "300.0",
        "tax_amount": "63.0",
        "tax_amount_base": "63.0"
      }
    ]
  },
  {
    "id": "264861191845709292",
    "administration_id": 123,
    "contact_id": "264861190840124899",
    "contact": {
      "id": "264861190840124899",
      "administration_id": 123,
      "company_name": "Foobar Holding B.V.",
      "firstname": "",
      "lastname": "",
      "address1": "Hoofdstraat 12",
      "address2": "",
      "zipcode": "1234AB",
      "city": "Amsterdam",
      "country": "NL",
      "phone": "",
      "delivery_method": "Email",
      "customer_id": "1",
      "tax_number": "",
      "chamber_of_commerce": "",
      "bank_account": "",
      "attention": "",
      "email": "info@example.com",
      "email_ubl": true,
      "send_invoices_to_attention": "",
      "send_invoices_to_email": "info@example.com",
      "send_estimates_to_attention": "",
      "send_estimates_to_email": "info@example.com",
      "sepa_active": false,
      "sepa_iban": "",
      "sepa_iban_account_name": "",
      "sepa_bic": "",
      "sepa_mandate_id": "",
      "sepa_mandate_date": null,
      "sepa_sequence_type": "RCUR",
      "credit_card_number": "",
      "credit_card_reference": "",
      "credit_card_type": null,
      "tax_number_validated_at": null,
      "tax_number_valid": null,
      "invoice_workflow_id": null,
      "estimate_workflow_id": null,
      "si_identifier": "",
      "si_identifier_type": null,
      "created_at": "2019-08-26T09:22:16.799Z",
      "updated_at": "2019-08-26T09:22:16.799Z",
      "version": 1566811336,
      "sales_invoices_url": "http://moneybird.dev/123/sales_invoices/8573864450b81cced0423803a218f6528aa52719da9f917d4302a30a38a21d12/all",
      "notes": [],
      "custom_fields": []
    },
    "invoice_id": "2019-0002",
    "recurring_sales_invoice_id": null,
    "workflow_id": "264861010714690884",
    "document_style_id": "264861011128878414",
    "identity_id": "264861010400118083",
    "draft_id": null,
    "state": "open",
    "invoice_date": "2019-08-26",
    "due_date": "2019-09-09",
    "payment_conditions": "We verzoeken u vriendelijk het bovenstaande bedrag van {document.total_price} voor {document.due_date} te voldoen op onze bankrekening onder vermelding van de omschrijving {document.payment_reference}. Voor vragen kunt u contact opnemen per e-mail.",
    "payment_reference": "RF820000000000000XCNQYQRQ",
    "reference": "Project X",
    "language": "nl",
    "currency": "EUR",
    "discount": "0.0",
    "original_sales_invoice_id": null,
    "paused": false,
    "paid_at": null,
    "sent_at": "2019-08-26",
    "created_at": "2019-08-26T09:22:17.777Z",
    "updated_at": "2019-08-26T09:22:18.151Z",
    "public_view_code": "151743",
    "version": 1566811338,
    "details": [
      {
        "id": "264861191849903597",
        "administration_id": 123,
        "tax_rate_id": "264861010337203517",
        "ledger_account_id": "264861010182014250",
        "product_id": null,
        "amount": "1 x",
        "amount_decimal": "1.0",
        "description": "Project X",
        "price": "300.0",
        "period": null,
        "row_order": 1,
        "total_price_excl_tax_with_discount": "300.0",
        "total_price_excl_tax_with_discount_base": "300.0",
        "tax_report_reference": ["NL/1a"],
        "created_at": "2019-08-26T09:22:17.782Z",
        "updated_at": "2019-08-26T09:22:18.148Z"
      }
    ],
    "payments": [],
    "total_paid": "0.0",
    "total_unpaid": "363.0",
    "total_unpaid_base": "363.0",
    "prices_are_incl_tax": false,
    "total_price_excl_tax": "300.0",
    "total_price_excl_tax_base": "300.0",
    "total_price_incl_tax": "363.0",
    "total_price_incl_tax_base": "363.0",
    "total_discount": "0.0",
    "url": "http://moneybird.dev/123/sales_invoices/538586b1fd43d693d658a696e0e64bf4f06192a690e7b4164fb66875ffd1016e/8573864450b81cced0423803a218f6528aa52719da9f917d4302a30a38a21d12",
    "custom_fields": [],
    "notes": [],
    "attachments": [],
    "events": [
      {
        "administration_id": 123,
        "user_id": 15668111646740,
        "action": "sales_invoice_created",
        "link_entity_id": null,
        "link_entity_type": null,
        "data": {},
        "created_at": "2019-08-26T09:22:17.790Z",
        "updated_at": "2019-08-26T09:22:17.790Z"
      },
      {
        "administration_id": 123,
        "user_id": 15668111646740,
        "action": "sales_invoice_send_email",
        "link_entity_id": null,
        "link_entity_type": null,
        "data": {
          "email_address": "info@example.com",
          "email_message": "Geachte Foobar Holding B.V.,\n\nIn de bijlage kunt u factuur 2019-0002 voor onze diensten vinden. Wij verzoeken u vriendelijk de factuur voor 09-09-2019 te voldoen.\n\nMet vriendelijke groet,\n\nParkietje B.V."
        },
        "created_at": "2019-08-26T09:22:18.179Z",
        "updated_at": "2019-08-26T09:22:18.179Z"
      }
    ],
    "tax_totals": [
      {
        "tax_rate_id": "264861010337203517",
        "taxable_amount": "300.0",
        "taxable_amount_base": "300.0",
        "tax_amount": "63.0",
        "tax_amount_base": "63.0"
      }
    ]
  },
  {
    "id": "264861191056131558",
    "administration_id": 123,
    "contact_id": "264861190840124899",
    "contact": {
      "id": "264861190840124899",
      "administration_id": 123,
      "company_name": "Foobar Holding B.V.",
      "firstname": "",
      "lastname": "",
      "address1": "Hoofdstraat 12",
      "address2": "",
      "zipcode": "1234AB",
      "city": "Amsterdam",
      "country": "NL",
      "phone": "",
      "delivery_method": "Email",
      "customer_id": "1",
      "tax_number": "",
      "chamber_of_commerce": "",
      "bank_account": "",
      "attention": "",
      "email": "info@example.com",
      "email_ubl": true,
      "send_invoices_to_attention": "",
      "send_invoices_to_email": "info@example.com",
      "send_estimates_to_attention": "",
      "send_estimates_to_email": "info@example.com",
      "sepa_active": false,
      "sepa_iban": "",
      "sepa_iban_account_name": "",
      "sepa_bic": "",
      "sepa_mandate_id": "",
      "sepa_mandate_date": null,
      "sepa_sequence_type": "RCUR",
      "credit_card_number": "",
      "credit_card_reference": "",
      "credit_card_type": null,
      "tax_number_validated_at": null,
      "tax_number_valid": null,
      "invoice_workflow_id": null,
      "estimate_workflow_id": null,
      "si_identifier": "",
      "si_identifier_type": null,
      "created_at": "2019-08-26T09:22:16.799Z",
      "updated_at": "2019-08-26T09:22:16.799Z",
      "version": 1566811336,
      "sales_invoices_url": "http://moneybird.dev/123/sales_invoices/8573864450b81cced0423803a218f6528aa52719da9f917d4302a30a38a21d12/all",
      "notes": [],
      "custom_fields": []
    },
    "invoice_id": "2019-0001",
    "recurring_sales_invoice_id": null,
    "workflow_id": "264861010714690884",
    "document_style_id": "264861011128878414",
    "identity_id": "264861010400118083",
    "draft_id": null,
    "state": "open",
    "invoice_date": "2019-08-26",
    "due_date": "2019-09-09",
    "payment_conditions": "We verzoeken u vriendelijk het bovenstaande bedrag van {document.total_price} voor {document.due_date} te voldoen op onze bankrekening onder vermelding van de omschrijving {document.payment_reference}. Voor vragen kunt u contact opnemen per e-mail.",
    "payment_reference": "RF640000000000000ANAZMBD5",
    "reference": "Project X",
    "language": "nl",
    "currency": "EUR",
    "discount": "0.0",
    "original_sales_invoice_id": null,
    "paused": false,
    "paid_at": null,
    "sent_at": "2019-08-26",
    "created_at": "2019-08-26T09:22:17.024Z",
    "updated_at": "2019-08-26T09:22:17.613Z",
    "public_view_code": "838593",
    "version": 1566811337,
    "details": [
      {
        "id": "264861191063471591",
        "administration_id": 123,
        "tax_rate_id": "264861010337203517",
        "ledger_account_id": "264861010182014250",
        "product_id": null,
        "amount": "1 x",
        "amount_decimal": "1.0",
        "description": "Project X",
        "price": "300.0",
        "period": "20190801..20190831",
        "row_order": 1,
        "total_price_excl_tax_with_discount": "300.0",
        "total_price_excl_tax_with_discount_base": "300.0",
        "tax_report_reference": ["NL/1a"],
        "created_at": "2019-08-26T09:22:17.032Z",
        "updated_at": "2019-08-26T09:22:17.609Z"
      }
    ],
    "payments": [],
    "total_paid": "0.0",
    "total_unpaid": "363.0",
    "total_unpaid_base": "363.0",
    "prices_are_incl_tax": false,
    "total_price_excl_tax": "300.0",
    "total_price_excl_tax_base": "300.0",
    "total_price_incl_tax": "363.0",
    "total_price_incl_tax_base": "363.0",
    "total_discount": "0.0",
    "url": "http://moneybird.dev/123/sales_invoices/3d7cbb7c1cc2e9f8fd8afb991fa3f232c5c4ca4f15dcb2386257809d9c00e872/8573864450b81cced0423803a218f6528aa52719da9f917d4302a30a38a21d12",
    "custom_fields": [],
    "notes": [],
    "attachments": [],
    "events": [
      {
        "administration_id": 123,
        "user_id": 15668111646740,
        "action": "sales_invoice_created",
        "link_entity_id": null,
        "link_entity_type": null,
        "data": {},
        "created_at": "2019-08-26T09:22:17.043Z",
        "updated_at": "2019-08-26T09:22:17.043Z"
      },
      {
        "administration_id": 123,
        "user_id": 15668111646740,
        "action": "sales_invoice_send_email",
        "link_entity_id": null,
        "link_entity_type": null,
        "data": {
          "email_address": "info@example.com",
          "email_message": "Geachte Foobar Holding B.V.,\n\nIn de bijlage kunt u factuur 2019-0001 voor onze diensten vinden. Wij verzoeken u vriendelijk de factuur voor 09-09-2019 te voldoen.\n\nMet vriendelijke groet,\n\nParkietje B.V."
        },
        "created_at": "2019-08-26T09:22:17.639Z",
        "updated_at": "2019-08-26T09:22:17.639Z"
      }
    ],
    "tax_totals": [
      {
        "tax_rate_id": "264861010337203517",
        "taxable_amount": "300.0",
        "taxable_amount_base": "300.0",
        "tax_amount": "63.0",
        "tax_amount_base": "63.0"
      }
    ]
  }
]
