test/support/fixtures/sent_sales_invoice.json

{
  "id": "264861210015434486",
  "administration_id": 123,
  "contact_id": "264861209891702515",
  "contact": {
    "id": "264861209891702515",
    "administration_id": 123,
    "company_name": "Foobar Holding B.V.",
    "firstname": "",
    "lastname": "",
    "address1": "Hoofdstraat 12",
    "address2": "",
    "zipcode": "1234AB",
    "city": "Amsterdam",
    "country": "NL",
    "phone": "",
    "delivery_method": "Email",
    "customer_id": "1",
    "tax_number": "",
    "chamber_of_commerce": "",
    "bank_account": "",
    "attention": "",
    "email": "info@example.com",
    "email_ubl": true,
    "send_invoices_to_attention": "",
    "send_invoices_to_email": "info@example.com",
    "send_estimates_to_attention": "",
    "send_estimates_to_email": "info@example.com",
    "sepa_active": false,
    "sepa_iban": "",
    "sepa_iban_account_name": "",
    "sepa_bic": "",
    "sepa_mandate_id": "",
    "sepa_mandate_date": null,
    "sepa_sequence_type": "RCUR",
    "credit_card_number": "",
    "credit_card_reference": "",
    "credit_card_type": null,
    "tax_number_validated_at": null,
    "tax_number_valid": null,
    "invoice_workflow_id": null,
    "estimate_workflow_id": null,
    "si_identifier": "",
    "si_identifier_type": null,
    "created_at": "2019-08-26T09:22:35.001Z",
    "updated_at": "2019-08-26T09:22:35.001Z",
    "version": 1566811355,
    "sales_invoices_url": "http://moneybird.dev/123/sales_invoices/4fe2f6b0bda81dbcabdb3f6de2a7e80df78547c72719c155977f2a09671f259e/all",
    "notes": [],
    "custom_fields": []
  },
  "invoice_id": "2019-0001",
  "recurring_sales_invoice_id": null,
  "workflow_id": "264861010714690884",
  "document_style_id": "264861011128878414",
  "identity_id": "264861010400118083",
  "draft_id": null,
  "state": "open",
  "invoice_date": "2019-08-26",
  "due_date": "2019-09-09",
  "payment_conditions": "We verzoeken u vriendelijk het bovenstaande bedrag van {document.total_price} voor {document.due_date} te voldoen op onze bankrekening onder vermelding van de omschrijving {document.payment_reference}. Voor vragen kunt u contact opnemen per e-mail.",
  "payment_reference": "RF240000000000000VMYV4NW5",
  "reference": "Project X",
  "language": "nl",
  "currency": "EUR",
  "discount": "0.0",
  "original_sales_invoice_id": null,
  "paused": false,
  "paid_at": null,
  "sent_at": "2019-08-26",
  "created_at": "2019-08-26T09:22:35.119Z",
  "updated_at": "2019-08-26T09:22:35.347Z",
  "public_view_code": "895150",
  "version": 1566811355,
  "details": [
    {
      "id": "264861210019628791",
      "administration_id": 123,
      "tax_rate_id": "264861010337203517",
      "ledger_account_id": "264861010182014250",
      "product_id": null,
      "amount": "1 x",
      "amount_decimal": "1.0",
      "description": "Project X",
      "price": "300.0",
      "period": null,
      "row_order": 1,
      "total_price_excl_tax_with_discount": "300.0",
      "total_price_excl_tax_with_discount_base": "300.0",
      "tax_report_reference": ["NL/1a"],
      "created_at": "2019-08-26T09:22:35.124Z",
      "updated_at": "2019-08-26T09:22:35.344Z"
    }
  ],
  "payments": [],
  "total_paid": "0.0",
  "total_unpaid": "363.0",
  "total_unpaid_base": "363.0",
  "prices_are_incl_tax": false,
  "total_price_excl_tax": "300.0",
  "total_price_excl_tax_base": "300.0",
  "total_price_incl_tax": "363.0",
  "total_price_incl_tax_base": "363.0",
  "total_discount": "0.0",
  "url": "http://moneybird.dev/123/sales_invoices/9a7dc8e16495d12caf405eb17072da7322194504df1c3047858d29ef2c22f34a/4fe2f6b0bda81dbcabdb3f6de2a7e80df78547c72719c155977f2a09671f259e",
  "custom_fields": [],
  "notes": [],
  "attachments": [],
  "events": [
    {
      "administration_id": 123,
      "user_id": 15668111646740,
      "action": "sales_invoice_created",
      "link_entity_id": null,
      "link_entity_type": null,
      "data": {},
      "created_at": "2019-08-26T09:22:35.131Z",
      "updated_at": "2019-08-26T09:22:35.131Z"
    },
    {
      "administration_id": 123,
      "user_id": 15668111646740,
      "action": "sales_invoice_send_email",
      "link_entity_id": null,
      "link_entity_type": null,
      "data": {
        "email_address": "info@example.com",
        "email_message": "Geachte Foobar Holding B.V.,\n\nIn de bijlage kunt u factuur 2019-0001 voor onze diensten vinden. Wij verzoeken u vriendelijk de factuur voor 09-09-2019 te voldoen.\n\nMet vriendelijke groet,\n\nParkietje B.V."
      },
      "created_at": "2019-08-26T09:22:35.373Z",
      "updated_at": "2019-08-26T09:22:35.373Z"
    }
  ],
  "tax_totals": [
    {
      "tax_rate_id": "264861010337203517",
      "taxable_amount": "300.0",
      "taxable_amount_base": "300.0",
      "tax_amount": "63.0",
      "tax_amount_base": "63.0"
    }
  ]
}
